---
type: Ceramic
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 12
tags: [revit-api, class]
---

# Ceramic

`Autodesk.Revit.DB.Visual.Ceramic` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CeramicApplication | 2018.1 | `public static string CeramicApplication { get ; }` |
| Property | CeramicBump | 2018.1 | `public static string CeramicBump { get ; }` |
| Property | CeramicBumpAmount | 2018.1 | `public static string CeramicBumpAmount { get ; }` |
| Property | CeramicBumpMap | 2018.1 | `public static string CeramicBumpMap { get ; }` |
| Property | CeramicColor | 2018.1 | `public static string CeramicColor { get ; }` |
| Property | CeramicColorByObject | 2018.1 | `public static string CeramicColorByObject { get ; }` |
| Property | CeramicPattern | 2018.1 | `public static string CeramicPattern { get ; }` |
| Property | CeramicPatternAmount | 2018.1 | `public static string CeramicPatternAmount { get ; }` |
| Property | CeramicPatternMap | 2018.1 | `public static string CeramicPatternMap { get ; }` |
| Property | CeramicType | 2018.1 | `public static string CeramicType { get ; }` |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |